Public Attributes | List of all members
API_NumberingGridLine Struct Reference
Drawing Manager
Represents a drawing numbering grid line of the layout. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_Coord  | begC
Coordinate of the starting point.
API_Coord  | endC
Coordinate of the endpoint.
short  | penInd
Pen attribute index.
API_AttributeIndex  | ltypeInd
Line type attribute index.
Detailed Description
Represents a drawing numbering grid line of the layout.
Remarks
This structure holds the data of a line of the grid-based drawing numbering system. The stucture is passed as a parameter of the APINumberingGridLineProc callback function while the drawing numbering grid lines are being enumerated by the ACAPI_Drawing_GetNumberingGridLines environment function.
Member Data Documentation
◆ begC
 API_NumberingGridLine::begC
Coordinate of the starting point.
◆ endC
 API_NumberingGridLine::endC
Coordinate of the endpoint.
◆ ltypeInd
 API_NumberingGridLine::ltypeInd
Line type attribute index.
◆ penInd
 API_NumberingGridLine::penInd
Pen attribute index.